In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [2]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ········

1. How many copies of the film Hunchback Impossible exist in the inventory system?

In [5]:
%%sql
select title, film_id from sakila.film
where title = 'Hunchback Impossible';

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[('HUNCHBACK IMPOSSIBLE', 439)]

In [13]:
%%sql
select count(*) as num_copies
from sakila.inventory
where film_id = 439;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(6,)]

In [14]:
%%sql
select count(*) as num_copies from sakila.inventory
join sakila.film
on sakila.inventory.film_id = sakila.film.film_id
where title = 'HUNCHBACK IMPOSSIBLE';

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(6,)]

--------------------------------------------------------

2. List all films whose length is longer than the average of all the films.

-------------------------------------------

In [15]:
%%sql
select avg(length) from sakila.film;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(Decimal('115.2720'),)]

In [22]:
%%sql
select title, length from sakila.film
where length > (select avg(length) from sakila.film)
group by title
order by length desc
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('CHICAGO NORTH', 185),
 ('MUSCLE BRIGHT', 185),
 ('GANGS PRIDE', 185),
 ('POND SEATTLE', 185),
 ('DARN FORRESTER', 185),
 ('SOLDIERS EVOLUTION', 185),
 ('HOME PITY', 185),
 ('CONTROL ANTHEM', 185),
 ('WORST BANGER', 185),
 ('SWEET BROTHERHOOD', 185)]

--------------------------------------------------------------------------

3. Use subqueries to display all actors who appear in the film Alone Trip.

--------------------------------------------------------------------------

In [26]:
%%sql
select * from sakila.film
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', 'Deleted Scenes,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42))]

In [27]:
%%sql
select * from sakila.film_actor
limit 1;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(1, 1, datetime.datetime(2006, 2, 15, 5, 5, 3))]

In [40]:
%%sql
select concat(sakila.actor.first_name,' ',sakila.actor.last_name) as Actors_in_movie 
from sakila.film_actor
join sakila.actor
on sakila.film_actor.actor_id = sakila.actor.actor_id
join sakila.film
on sakila.film.film_id = sakila.film_actor.film_id
where title = 'ALONE TRIP';

 * mysql+pymysql://root:***@localhost/sakila
8 rows affected.

[('ED CHASE',),
 ('KARL BERRY',),
 ('UMA WOOD',),
 ('WOODY JOLIE',),
 ('SPENCER DEPP',),
 ('CHRIS DEPP',),
 ('LAURENCE BULLOCK',),
 ('RENEE BALL',)]

--------------------------------------------------------

4. Sales have been lagging among young families, and you wish to target all family movies for a promotion. Identify all movies categorized as family films.

----------------------------------------

In [45]:
%%sql
select * from category
limit 2;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 'Action', datetime.datetime(2006, 2, 15, 4, 46, 27)),
 (2, 'Animation', datetime.datetime(2006, 2, 15, 4, 46, 27))]

In [46]:
%%sql
select * from film
limit 2;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', 'Deleted Scenes,Behind the Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42)),
 (2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 1, None, 3, Decimal('4.99'), 48, Decimal('12.99'), 'G', 'Trailers,Deleted Scenes', datetime.datetime(2006, 2, 15, 5, 3, 42))]

In [47]:
%%sql
select * from film_category
limit 2;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 6, datetime.datetime(2006, 2, 15, 5, 7, 9)),
 (2, 11, datetime.datetime(2006, 2, 15, 5, 7, 9))]

In [50]:
%%sql
select title from sakila.film
join sakila.film_category
on sakila.film_category.film_id = sakila.film.film_id
join sakila.film_category
on sakila.film_category.category_id = sakila.category.category_id
where sakila.category.name = 'Family';

 * mysql+pymysql://root:***@localhost/sakila
(pymysql.err.OperationalError) (1066, "Not unique table/alias: 'film_category'")
[SQL: select count(*) from sakila.film
join sakila.film_category
on sakila.film_category.film_id = sakila.film.film_id
join sakila.film_category
on sakila.film_category.category_id = sakila.category.category_id
where sakila.category.name = 'Family';]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [57]:
%%sql
select sakila.film.title, sakila.category.name as Category from sakila.film
join sakila.film_category
on sakila.film.film_id = sakila.film_category.film_id
join sakila.category
on sakila.category.category_id = sakila.film_category.category_id
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('AMADEUS HOLY', 'Action'),
 ('AMERICAN CIRCUS', 'Action'),
 ('ANTITRUST TOMATOES', 'Action'),
 ('ARK RIDGEMONT', 'Action'),
 ('BAREFOOT MANCHURIAN', 'Action')]

In [55]:
%%sql

select title from (select sakila.film.title, sakila.category.name as Category from sakila.film
                   join sakila.film_category
                   on sakila.film.film_id = sakila.film_category.film_id
                   join sakila.category
                   on sakila.category.category_id = sakila.film_category.category_id) as s
where Category = 'Family'
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('AFRICAN EGG',),
 ('APACHE DIVINE',),
 ('ATLANTIS CAUSE',),
 ('BAKED CLEOPATRA',),
 ('BANG KWAI',),
 ('BEDAZZLED MARRIED',),
 ('BILKO ANONYMOUS',),
 ('BLANKET BEVERLY',),
 ('BLOOD ARGONAUTS',),
 ('BLUES INSTINCT',)]

--------------------------

5. Get name and email from customers from Canada using subqueries. Do the same with joins. Note that to create a join, you will have to identify the correct tables with their primary keys and foreign keys, that will help you get the relevant information.

-------------------------

In [58]:
%%sql
select * from sakila.customer
limit 2;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', 5, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20)),
 (2, 1, 'PATRICIA', 'JOHNSON', 'PATRICIA.JOHNSON@sakilacustomer.org', 6, 1, datetime.datetime(2006, 2, 14, 22, 4, 36), datetime.datetime(2006, 2, 15, 4, 57, 20))]

In [59]:
%%sql
select * from sakila.address
limit 2;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', b'\x00\x00\x00\x00\x01\x01\x00\x00\x00>\n2]c4\\\xc0v\x1f\xdb\x8d\x99\xd9H@', datetime.datetime(2014, 9, 25, 22, 30, 27)),
 (2, '28 MySQL Boulevard', None, 'QLD', 576, '', '', b'\x00\x00\x00\x00\x01\x01\x00\x00\x00\x8e\x10\xd4\xdf\x81$c@N\xe0\x8cP"\xa2;\xc0', datetime.datetime(2014, 9, 25, 22, 30, 9))]

In [60]:
%%sql
select * from sakila.city
limit 2;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 'A Coruña (La Coruña)', 87, datetime.datetime(2006, 2, 15, 4, 45, 25)),
 (2, 'Abha', 82, datetime.datetime(2006, 2, 15, 4, 45, 25))]

In [61]:
%%sql
select * from sakila.country
limit 2;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[(1, 'Afghanistan', datetime.datetime(2006, 2, 15, 4, 44)),
 (2, 'Algeria', datetime.datetime(2006, 2, 15, 4, 44))]

In [66]:
%%sql

select sakila.customer.email, sakila.address.city_id from sakila.customer
join sakila.address
on sakila.customer.address_id = sakila.address.address_id
limit 2;

 * mysql+pymysql://root:***@localhost/sakila
2 rows affected.

[('JULIE.SANCHEZ@sakilacustomer.org', 1),
 ('PEGGY.MYERS@sakilacustomer.org', 2)]

In [ ]:
%%sql
select sakila.customer.email from (select sakila.customer.email, sakila.address.city_id from sakila.customer join sakila.address on sakila.customer.address_id = sakila.address.address_id)

In [76]:
%%sql

-- Solution subqueries

select concat(first_name , ' ' , last_name) as Customer_Name, email
from sakila.customer
where address_id in (
  select address_id
  from sakila.address
  where city_id in (
    select city_id
    from sakila.city
    where country_id in (
      select country_id
      from sakila.country
      where country = 'Canada'
     )
  )
);

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('DERRICK BOURQUE', 'DERRICK.BOURQUE@sakilacustomer.org'),
 ('DARRELL POWER', 'DARRELL.POWER@sakilacustomer.org'),
 ('LORETTA CARPENTER', 'LORETTA.CARPENTER@sakilacustomer.org'),
 ('CURTIS IRBY', 'CURTIS.IRBY@sakilacustomer.org'),
 ('TROY QUIGLEY', 'TROY.QUIGLEY@sakilacustomer.org')]

In [80]:
%%sql

-- Solution joins concat(cu.first_name,' ',cu.last_name) as Customer_name

select sakila.customer.email from sakila.customer
join sakila.address
on sakila.customer.address_id = sakila.address.address_id
join sakila.city
on sakila.address.city_id = sakila.city.city_id
join sakila.country
on sakila.city.country_id = sakila.country.country_id
where sakila.country.country = "Canada";

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[('DERRICK.BOURQUE@sakilacustomer.org',),
 ('DARRELL.POWER@sakilacustomer.org',),
 ('LORETTA.CARPENTER@sakilacustomer.org',),
 ('CURTIS.IRBY@sakilacustomer.org',),
 ('TROY.QUIGLEY@sakilacustomer.org',)]

---------------------------------------

6. Which are films starred by the most prolific actor? Most prolific actor is defined as the actor that has acted in the most number of films. First you will have to find the most prolific actor and then use that actor_id to find the different films that he/she starred.

----------------------------------------------

In [94]:
%%sql

select actor_id, count(film_id) as Films from sakila.film_actor
group by actor_id
order by Films desc
limit 5;

 * mysql+pymysql://root:***@localhost/sakila
5 rows affected.

[(107, 42), (102, 41), (198, 40), (181, 39), (23, 37)]

In [90]:
%%sql

-- 6a

-- get the most prolific author

select actor_id from (
  select actor_id, count(film_id) as Films from sakila.film_actor
  group by actor_id
  order by Films desc
  limit 1) as s;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(107,)]

In [96]:
%%sql

-- 6b

-- now get the films starred by the most prolific actor

select fi.title, actor_id from sakila.film_actor as fa 
join sakila.film as fi
on fa.film_id = fi.film_id
where actor_id = (
  select actor_id from (
    select actor_id, count(film_id) as Films from sakila.film_actor
    group by actor_id
    order by Films desc
  limit 1) 
as s1)
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('BED HIGHBALL', 107),
 ('CALENDAR GUNFIGHT', 107),
 ('CHAMBER ITALIAN', 107),
 ('CHAPLIN LICENSE', 107),
 ('CHARIOTS CONSPIRACY', 107),
 ('CLUELESS BUCKET', 107),
 ('COLDBLOODED DARLING', 107),
 ('CONEHEADS SMOOCHY', 107),
 ('DARKNESS WAR', 107),
 ('DEER VIRGINIAN', 107)]

-----------------------

7. Films rented by most profitable customer. You can use the customer table and payment table to find the most profitable customer ie the customer that has made the largest sum of payments

-----------------------

In [98]:
%%sql
-- 7a
-- most profitable customer
select customer_id, Payments from (
  select customer_id, sum(amount) as Payments from sakila.payment
  group by customer_id
  order by Payments desc
  limit 1) 
as s;

 * mysql+pymysql://root:***@localhost/sakila
1 rows affected.

[(526, Decimal('221.55'))]

In [99]:
%%sql
-- 7b
-- films rented by most profitable customer

select title from (select pa.customer_id, pa.rental_id, re.inventory_id, i.film_id, fi.title  from sakila.payment as pa
join sakila.rental as re
on pa.rental_id = re.rental_id
join sakila.inventory as i
on re.inventory_id = i.inventory_id
join sakila.film as fi
on i.film_id = fi.film_id) as s1
where customer_id = (select customer_id from (select customer_id, sum(amount) as Payments from sakila.payment
group by customer_id
order by Payments desc
limit 1) as s2)
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[('DESTINY SATURDAY',),
 ('CYCLONE FAMILY',),
 ('SLUMS DUCK',),
 ('FIDELITY DEVIL',),
 ('SPLASH GUMP',),
 ('MISSION ZOOLANDER',),
 ('MULHOLLAND BEAST',),
 ('PRINCESS GIANT',),
 ('PARIS WEEKEND',),
 ('RACER EGG',)]

------------------

8.Get the client_id and the total_amount_spent of those clients who spent more than the average of the total_amount spent by each client.

------------------------------

In [100]:
%%sql
-- 8
select customer_id, sum(amount) as Customer_total_spent from sakila.payment
group by customer_id
having Customer_total_spent > (select round(avg(Customer_total_payment),2) as Average from (select customer_id, round(sum(amount),2) as Customer_total_payment from sakila.payment
group by customer_id) as s)
order by Customer_total_spent desc
limit 10;

 * mysql+pymysql://root:***@localhost/sakila
10 rows affected.

[(526, Decimal('221.55')),
 (148, Decimal('216.54')),
 (144, Decimal('195.58')),
 (137, Decimal('194.61')),
 (178, Decimal('194.61')),
 (459, Decimal('186.62')),
 (469, Decimal('177.60')),
 (468, Decimal('175.61')),
 (236, Decimal('175.58')),
 (181, Decimal('174.66'))]